packages/artillery-plugin-publish-metrics/test/config-newrelic-api.yaml
config:
  target: https://artillery.io
  phases:
    - duration: 11
      arrivalRate: 1
  plugins:
    publish-metrics:
      - type: newrelic
        region: 'us'
        licenseKey: "{{ $processEnvironment.NR_LICENSE_KEY }}"
        prefix: 'artillery.publish_metrics_plugin.'
        attributes:
          - "testId:{{ $processEnvironment.TEST_ID }}"
          - "reporterType:newrelic-metric-api"